In [25]:
import pandas as pd
import sys
import os

project_root = os.path.abspath(os.path.join(os.getcwd(), '..', '..'))
path_to_functions = os.path.join(project_root, '1-cluster_retail_uci', 'functions')
sys.path.append(path_to_functions)

In [26]:
from functions import (
    normalize_column_names,
    df_column_to_string,
    filter_rows_starting_with,
    remove_and_display_unique_prefixes,
    get_abnormal_values,
    display_rows_by_list,
    filter_consecutive_digits,
    exclude_values_by_list,
    drop_na_duplicates_and_zeroes,
)

In [ ]:
# df = pd.read_pickle('df_2010-2011.pkl')

In [29]:
# Assuming 'df' is your raw input data
df_cleaned = cleaning_pipeline(df)

# Verify the final result
print("\nFinal Cleaned DataFrame Info:")
display(df_cleaned.info())

'invoice' converted to string type.
object
Filtered rows where 'invoice' starts with 'C'
     invoice stockcode                       description  quantity  \
141  C536379         D                          Discount        -1
154  C536383    35004C   SET OF 3 COLOURED  FLYING DUCKS        -1
235  C536391     22556    PLASTERS IN TIN CIRCUS PARADE        -12
236  C536391     21984  PACK OF 12 PINK PAISLEY TISSUES        -24
237  C536391     21983  PACK OF 12 BLUE PAISLEY TISSUES        -24

            invoicedate  price  customer_id         country
141 2010-12-01 09:41:00  27.50      14527.0  United Kingdom
154 2010-12-01 09:49:00   4.65      15311.0  United Kingdom
235 2010-12-01 10:24:00   1.65      17548.0  United Kingdom
236 2010-12-01 10:24:00   0.29      17548.0  United Kingdom
237 2010-12-01 10:24:00   0.29      17548.0  United Kingdom
Results for prefix: 'C'

,invoice,stockcode,description,quantity,invoicedate,price,customer_id,country
141,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527.0,United Kingdom
154,C536383,35004C,SET OF 3 COLOURED FLYING DUCKS,-1,2010-12-01 09:49:00,4.65,15311.0,United Kingdom
235,C536391,22556,PLASTERS IN TIN CIRCUS PARADE,-12,2010-12-01 10:24:00,1.65,17548.0,United Kingdom
236,C536391,21984,PACK OF 12 PINK PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom
237,C536391,21983,PACK OF 12 BLUE PAISLEY TISSUES,-24,2010-12-01 10:24:00,0.29,17548.0,United Kingdom

Results for prefix: 'A'

,invoice,stockcode,description,quantity,invoicedate,price,customer_id,country
299982,A563185,B,Adjust bad debt,1,2011-08-12 14:50:00,11062.06,NaN,United Kingdom
299983,A563186,B,Adjust bad debt,1,2011-08-12 14:51:00,-11062.06,NaN,United Kingdom
299984,A563187,B,Adjust bad debt,1,2011-08-12 14:52:00,-11062.06,NaN,United Kingdom

'stockcode' converted to string type.
object
33 abnormal values:
['POST', 'D', 'C2', 'DOT', 'M', 'BANK CHARGES', 'S', 'AMAZONFEE', 'DCGS0076', 'DCGS0003', 'gift_0001_40', 'DCGS0070', 'm', 'gift_0001_50', 'gift_0001_30', 'gift_0001_20', 'DCGS0055', 'DCGS0072', 'DCGS0074', 'DCGS0069', 'DCGS0057', 'DCGSSBOY', 'DCGSSGIRL', 'gift_0001_10', 'PADS', 'DCGS0004', 'DCGS0073', 'DCGS0071', 'DCGS0066P', 'DCGS0068', 'DCGS0067', 'B', 'CRUK']
Entries dropped: 9291
Removed 2409 rows where 'stockcode' was in the exclusion list.
Number of duplicated rows: 5187
Duplicated rows (sorted):

,invoice,stockcode,description,quantity,invoicedate,price,customer_id,country
494,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom
517,536409,21866,UNION JACK FLAG LUGGAGE TAG,1,2010-12-01 11:45:00,1.25,17908.0,United Kingdom
485,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,2010-12-01 11:45:00,4.95,17908.0,United Kingdom
539,536409,22111,SCOTTIE DOG HOT WATER BOTTLE,1,2010-12-01 11:45:00,4.95,17908.0,United Kingdom
489,536409,22866,HAND WARMER SCOTTY DOG DESIGN,1,2010-12-01 11:45:00,2.10,17908.0,United Kingdom

Duplicates dropped.
Rows with price equal to 0:

,invoice,stockcode,description,quantity,invoicedate,price,customer_id,country
622,536414,22139,NaN,56,2010-12-01 11:52:00,0.0,NaN,United Kingdom
1510,536545,21134,NaN,1,2010-12-01 14:32:00,0.0,NaN,United Kingdom
1985,536547,37509,NaN,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
1986,536546,22145,NaN,1,2010-12-01 14:33:00,0.0,NaN,United Kingdom
2022,536552,20950,NaN,1,2010-12-01 14:34:00,0.0,NaN,United Kingdom

Rows with price equal to 0 removed.

Final Cleaned DataFrame Info:
<class 'pandas.core.frame.DataFrame'>
Index: 391150 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoice      391150 non-null  object
 1   stockcode    391150 non-null  object
 2   description  391150 non-null  object
 3   quantity     391150 non-null  int64
 4   invoicedate  391150 non-null  datetime64[ns]
 5   price        391150 non-null  float64
 6   customer_id  391150 non-null  float64
 7   country      391150 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 26.9+ MB

None

In [ ]:
# def cleaning_pipeline(df):
#     # 1. Normalize column names
#     df = normalize_column_names(df)

#     # 2. Column 'invoice' to string
#     df = df_column_to_string(df, "invoice", show_head=False)

#     # 3 Filter out rows where 'invoice' starts with 'C'
#     df_cancellation_invoices = filter_rows_starting_with(df, "invoice", "C")

#     # 4. Remove and display unique prefixes in 'invoice' column
#     remove_and_display_unique_prefixes(df, "invoice")

#     # 5 Column 'stockcode' to string
#     df_column_to_string(df, 'stockcode')

#     # 6. Remove abnormal codes
#     stockcodes_abnormal, count_abnormal = get_abnormal_values(df, 'stockcode', print_list=True)

#     # 7 Filter out abnormal invoices ( exclude NOT 6 consecutive digits)
#     df, mask, entries_dropped = filter_consecutive_digits(df, 'invoice', 6) 
#     print("Entries dropped:", entries_dropped)

#     # 8 Drop abnormal stockcodes by list
#     df = exclude_values_by_list(df, "stockcode", stockcodes_abnormal)

#     # 9. Drop NA, duplicates, zero price
#     df = drop_na_duplicates_and_zeroes(df)
#     df.describe()
#     return df